УТ_для_edt/src/DataProcessors/смартПодборМаркировкиВДокументы/смартПодборМаркировкиВДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартПодборМаркировкиВДокументы</name>
  <comment>//++ #Б5878 смарт: Шляпников 27.02.2026 / Маркировка радиоэлектронной продукции. Тестирование основного сценария. Выявление ошибок.</comment>
</mdclass:DataProcessor>

УТ_для_edt/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШтрихкода</name>
    <type>
      <types>EnumRef.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>DefinedType.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.ХарактеристикаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>DefinedType.Упаковка</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>DefinedType.СерияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУказанияСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаЗначенияШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшСуммаНормализации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПотребительскихУпаковок</name>
    <comment>Количество потребительских упаковок (при маркировке нефиксированного базового количества)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартПодборМаркировкиВДокументы/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаПроверки = ТекущаяДата();
	
	Если Параметры.Свойство("Документ") Тогда
		Документ = Параметры.Документ;
		ДатаПроверки = Документ.Дата;
	КонецЕсли;
		
	Если Параметры.Свойство("ТаблицаНоменклатуры") Тогда
		
		Дерево = РеквизитФормыВЗначение("ДеревоШтрихкодов");
		
		Для каждого стрТовары Из Параметры.ТаблицаНоменклатуры Цикл
			
			Если смартМаркировка.НоменклатураПодлежитОбязательнойМаркировке(стрТовары.Номенклатура, ДатаПроверки) Тогда
				
				НоваяСтрока = Дерево.Строки.Добавить();
				НоваяСтрока.Номенклатура = стрТовары.Номенклатура;
				НоваяСтрока.КоличествоВДокументе = стрТовары.Количество;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(Дерево, "ДеревоШтрихкодов");
		
	КонецЕсли;
	
	Если Параметры.Свойство("ТаблицаШтрихкодов") Тогда
		
		Дерево = РеквизитФормыВЗначение("ДеревоШтрихкодов");
		
		Для каждого стрШтрихкоды Из Параметры.ТаблицаШтрихкодов Цикл
			
			НайденныеСтроки = Дерево.Строки.НайтиСтроки(Новый Структура("Номенклатура", стрШтрихкоды.ШтрихкодУпаковки.Номенклатура), Ложь);
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Для каждого стрТовары Из НайденныеСтроки Цикл
					
					Если стрТовары.КоличествоПодобрано < стрТовары.КоличествоВДокументе Тогда
						
						НоваяСтрока = стрТовары.Строки.Добавить();
						НоваяСтрока.КоличествоВДокументе = 1;
						НоваяСтрока.КоличествоПодобрано = 1;
						НоваяСтрока.ШтрихкодУпаковки = стрШтрихкоды.ШтрихкодУпаковки;
						
						стрТовары.КоличествоПодобрано = стрТовары.Строки.Итог("КоличествоПодобрано", Ложь);
						
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(Дерево, "ДеревоШтрихкодов");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ПодобратьМаркировкуПоМассивуШтрихкодов(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытия

&НаКлиенте
Процедура ПодобратьШтрихкоды(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоШтрихкодов.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущаяСтрока.ПолучитьРодителя() = Неопределено Тогда
		ТекущаяСтрока = ТекущаяСтрока.ПолучитьРодителя();
	КонецЕсли;
	
	Если ТекущаяСтрока.КоличествоПодобрано = ТекущаяСтрока.КоличествоВДокументе Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ШтрихкодыУпаковокТоваров.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура)), ЭтаФорма,,,, Новый ОписаниеОповещения("ПодобратьШтрихкодыЗавершение", ЭтаФорма, Новый Структура("ИДСтроки", Элементы.ДеревоШтрихкодов.ТекущаяСтрока)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьДобавленияШтрихкода(Штрихкод)
	
	Дерево = РеквизитФормыВЗначение("ДеревоШтрихкодов");
	
	НайденныеСтроки = Дерево.Строки.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", Штрихкод), Истина);
	
	Возврат НайденныеСтроки.Количество() = 0;
	
КонецФункции

&НаКлиенте
Процедура ПодобратьШтрихкодыЗавершение(Значение, ДопПараметры) Экспорт
	
	Если НЕ Значение = Неопределено Тогда
		
		СтрокаРодитель = ДеревоШтрихкодов.НайтиПоИдентификатору(ДопПараметры.ИДСтроки);
		Если НЕ СтрокаРодитель.ПолучитьРодителя() = Неопределено Тогда
			СтрокаРодитель = СтрокаРодитель.ПолучитьРодителя();
		КонецЕсли;
		
		Если НЕ ПроверитьВозможностьДобавленияШтрихкода(Значение) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Штрихкод %1 уже добавлен в документ", Значение));
			Возврат;
		КонецЕсли;
		
		Строки = СтрокаРодитель.ПолучитьЭлементы();
		
		НоваяСтрока = Строки.Добавить();
		НоваяСтрока.ШтрихкодУпаковки = Значение;
		НоваяСтрока.КоличествоВДокументе = 1;
		НоваяСтрока.КоличествоПодобрано = 1;
		
		СтрокаРодитель.КоличествоПодобрано = СтрокаРодитель.КоличествоПодобрано + 1;
		
		Элементы.ДеревоШтрихкодов.Развернуть(ДопПараметры.ИДСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьШтрихкоды(Команда)
	
	МассивУдаляемыхСтрок = Новый Массив;
	
	Для каждого ИД Из Элементы.ДеревоШтрихкодов.ВыделенныеСтроки Цикл
		
		стрДерево = ДеревоШтрихкодов.НайтиПоИдентификатору(ИД);
		Родитель = стрДерево.ПолучитьРодителя();
		
		Если Родитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивУдаляемыхСтрок.Добавить(Новый Структура("Родитель,Строка", Родитель, стрДерево));
		
	КонецЦикла;
	
	Для каждого стрМассив Из МассивУдаляемыхСтрок Цикл
		
		Строки = стрМассив.Родитель.ПолучитьЭлементы();
		Строки.Удалить(стрМассив.Строка);
		стрМассив.Родитель.КоличествоПодобрано = стрМассив.Родитель.КоличествоПодобрано - 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокШтрихкодовДляДокумента()
	
	Массив = Новый Массив;
	Дерево = РеквизитФормыВЗначение("ДеревоШтрихкодов");
	
	Для каждого стрДерево Из Дерево.Строки Цикл
		Для каждого стрШтрихкод Из стрДерево.Строки Цикл
			Массив.Добавить(стрШтрихкод.ШтрихкодУпаковки);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Закрыть(ПолучитьСписокШтрихкодовДляДокумента());
	Иначе
		ПеренестиПодобранныеШКВДокумент();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ПеренестиПодобранныеШКВДокумент()
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивШК = ПолучитьСписокШтрихкодовДляДокумента();
	
	ТекОбъект = Документ.ПолучитьОбъект();
	ТекОбъект.ШтрихкодыУпаковок.Очистить();
	
	Для каждого стрШтрихкод Из МассивШК Цикл
		
		НоваяСтрока = ТекОбъект.ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ШтрихкодУпаковки = стрШтрихкод;
		
	КонецЦикла;
	
	ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьМаркировкуПоМассивуШтрихкодов(МассивШК)
	
	Для каждого Штрихкод Из МассивШК Цикл
		
		ШтрихкодУпаковки = смартМаркировка.НайтиКИЗПоШК(Штрихкод.Штрихкод);
		
		Если ШтрихкодУпаковки = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не найдена упаковка со штрихкодом %1", Штрихкод));
			Возврат;
		КонецЕсли;
		
		Если НЕ ПроверитьВозможностьДобавленияШтрихкода(ШтрихкодУпаковки) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Штрихкод %1 уже добавлен в документ", ШтрихкодУпаковки));
			Возврат;
		КонецЕсли;
		
		Строки = ДеревоШтрихкодов.ПолучитьЭлементы();
		
		Для каждого стрНоменклатура Из Строки Цикл
			
			Если стрНоменклатура.Номенклатура = ШтрихкодУпаковки.Номенклатура Тогда
		
				Если стрНоменклатура.КоличествоПодобрано < стрНоменклатура.КоличествоВДокументе Тогда
					
					СтрокиШтрихкоды = стрНоменклатура.ПолучитьЭлементы();
					
					НоваяСтрока = СтрокиШтрихкоды.Добавить();
					НоваяСтрока.КоличествоВДокументе = 1;
					НоваяСтрока.КоличествоПодобрано = 1;
					НоваяСтрока.ШтрихкодУпаковки = ШтрихкодУпаковки;
					
					стрНоменклатура.КоличествоПодобрано = стрНоменклатура.КоличествоПодобрано + 1;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
